Revit 2026 API

# SelectionUIOptions Methods

---

The SelectionUIOptions type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |
|  | ElementSelectsAsPinned | Checks whether the specified element will be treated as pinned for the purposes of selection. |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetSelectionUIOptions | Returns the current user's SelectionOptions. |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

SelectionUIOptions Class

Autodesk.Revit.UI Namespace